{
  "metadata": {
    "title": "สร้างแอป Next",
    "description": "สร้างโดย create next app"
  },
  "Header": {
    "Home": "หน้าแรก",
    "Certificate": "ใบรับรอง",
    "Documentation": "เอกสาร",
    "About": "เกี่ยวกับ"
  },
  "Resume": {
    "address": "156/ข หมู่ 6 บางปลากด ป่าโมก อ่างทอง 14130",

    "objectives": "นักศึกษาจบใหม่ที่มีความสนใจด้านการพัฒนา Web Application และ Backend System มีพื้นฐานการพัฒนาเว็บด้วย TypeScript, Node.js และ Database พร้อมประสบการณ์ใช้งานเครื่องมือและกระบวนการพัฒนาแบบสมัยใหม่ ต้องการเริ่มต้นเส้นทางอาชีพในตำแหน่ง Web Developer พร้อมเรียนรู้และพัฒนาทักษะใหม่ เพื่อมีส่วนร่วมในการพัฒนาระบบที่มีคุณภาพ ดูแลรักษาง่าย มีประสิทธิภาพ และสามารถขยายต่อในอนาคต เป็นผู้ที่ทำงานเป็นทีมได้ดี ชอบแก้ไขปัญหา พร้อมช่วยเหลือเพื่อนร่วมงาน และพัฒนาทักษะทางเทคนิคอย่างต่อเนื่อง",

    "education": {
      "university": "มหาวิทยาลัยธรรมศาสตร์",
      "region": "ประเทศไทย",
      "degree": "ปริญญาตรี, วิศวกรรมศาสตรบัณฑิต สาขาวิศวกรรมคอมพิวเตอร์"
    },

    "experiences": [
      {
        "topic": "งานในรายวิชา, มหาวิทยาลัยธรรมศาสตร์",
        "start": "Oct 2023",
        "end": "Dec 2023",
        "responsibilities": [
          "ติดตั้งและปรับใช้เซิร์ฟเวอร์ Linux โดยใช้ Rocky Linux 9 บนแพลตฟอร์มคลาวด์ Linode เพื่อโฮสต์เว็บแอปพลิเคชัน",
          "ตั้งค่าและดูแลบริการต่าง ๆ ได้แก่ DNS Server, Apache Web Server, ฐานข้อมูล MySQL และ SSH สำหรับการเข้าถึงระบบจากระยะไกล"
        ]
      },
      {
        "topic": "นักศึกษาฝึกงานด้าน IT Support, บริษัท เบอร์ล่า คาร์บอน (ประเทศไทย) จำกัด (มหาชน)",
        "start": "Jun 2024",
        "end": "Jul 2024",
        "responsibilities": [
          "ให้การสนับสนุนด้านเทคนิคแก่ผู้ใช้งาน แก้ไขปัญหาด้านฮาร์ดแวร์และซอฟต์แวร์",
          "ช่วยติดตั้ง ตั้งค่า และดูแลรักษาคอมพิวเตอร์ เครื่องพิมพ์ และอุปกรณ์เครือข่าย"
        ]
      },
      {
        "topic": "สำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ (สวทช.) (กลุ่มนวัตกรรมดิจิทัลสำหรับเมือง, ทีม Traffy)",
        "start": "Jan 2025",
        "end": "Apr 2025",
        "responsibilities": [
          "พัฒนา LINE Chatbot เพื่ออำนวยความสะดวกในการรายงานปัญหาภายในกลุ่ม LINE ช่วยเพิ่มประสิทธิภาพในการสื่อสารและการแก้ไขปัญหา"
        ]
      },
      {
        "topic": "ศูนย์การแพทย์สมเด็จพระเทพรัตนราชสุดาฯ (งานศึกษา วิจัยและบริการวิชาการ)",
        "start": "Aug 2025",
        "end": "Dec 2025",
        "responsibilities": [
          "พัฒนาระบบบริหารจัดการการสมัครฝึกงานบนเว็บ รองรับการจัดตารางอัตโนมัติและการจัดเก็บข้อมูลแบบรวมศูนย์",
          "ออกแบบสถาปัตยกรรมระบบแบบแยกส่วน Frontend-Backend โดยบูรณาการ Google Forms, Google Sheets และ Encore.ts เพื่อการจัดตารางอัตโนมัติและให้บริการ API"
        ]
      }
    ],

    "activities": [
      {
        "topic": "การฝึกอบรมเชิงปฏิบัติการ: \"การพัฒนาเซิร์ฟเวอร์อีเมลเพื่อรองรับอีเมลภาษาไทย (EAI)\" โดย THNIC",
        "date": "Nov 2023",
        "details": [
          "เข้าร่วมการอบรมเชิงปฏิบัติการแบบเข้มข้นโดย THNIC เพื่อเสริมสร้างทักษะในการพัฒนาเซิร์ฟเวอร์อีเมลที่สามารถรองรับอีเมลภาษาไทย (EAI) ได้อย่างถูกต้อง",
          "ตั้งค่าและปรับใช้เซิร์ฟเวอร์อีเมลส่วนบุคคลบนระบบปฏิบัติการ Ubuntu ได้สำเร็จ ทำให้ได้รับประสบการณ์เชิงปฏิบัติด้านการติดตั้งและดูแลระบบเซิร์ฟเวอร์"
        ]
      }
    ]
  },
  "Certificate": {
    "GDSC_Linux": "คู่มือสำหรับผู้เริ่มต้นในการใช้ Shell Scripting และคำสั่งพื้นฐานของ Linux",
    "GDSC_react": "คู่มือสำหรับผู้เริ่มต้นในการใช้ React ซึ่งครอบคลุมพื้นฐานการสร้างส่วนติดต่อผู้ใช้",
    "GDSC_figma": "คู่มือสำหรับผู้เริ่มต้นในการใช้ Figma ซึ่งครอบคลุมพื้นฐานการออกแบบ UI/UX",
    "CCNA_intro": "บทนำสู่แนวคิด เครือข่าย โปรโตคอล และเทคโนโลยีต่าง ๆ",
    "CCNA_switch": "หลักสูตรครอบคลุมเกี่ยวกับการสวิตช์ การกำหนดเส้นทาง และเครือข่ายไร้สายที่จำเป็น",
    "NSTDA_intrenship": "จดหมายรับรองสำหรับการฝึกงานที่ สวทช. ทีม Traffy",
    "Golden_Jubilee_internship": "จดหมายรับรองสำหรับการฝึกงานที่ ศูนย์การแพทย์กาญจนาภิเษก"
  },
  "SEAKEEN": {
    "sea_profile_url": "/image/sea_th.jpg",
    "keen_profile_url": "/image/keen_th.jpg",
    "schedule_description": "กิจกรรมที่กำลังจะเกิดขึ้นและกิจกรรมที่ผ่านมาเกี่ยวกับ SEAKEEN"
  },
  "About": {
    "main": "**Ottric** มาจากการผสมผสานระหว่าง __นาก (otter)__ และ __กุ้งเครย์ฟิชสีแอปริคอต (apricot crayfish)__ ชื่อของเราสื่อถึงความสนุกสนาน ความอบอุ่น และเอกลักษณ์ที่ได้รับแรงบันดาลใจจาก SEAKEEN และ Nong Nooong — สะท้อนความสัมพันธ์ที่สวยงามระหว่างศิลปินและแฟน ๆ ที่เป็นหัวใจของแบรนด์เรา",
    "sub": "ที่ Ottric เราเชื่อในความเรียบง่ายที่มีสไตล์ และรายละเอียดที่ใส่ใจซึ่งสร้างรอยยิ้ม \n**Ottric คือที่ที่ความคิดสร้างสรรค์พบกับเสน่ห์ — สนุกสนานตามธรรมชาติ โดดเด่นอย่างไม่เหมือนใคร.**"
  }
}
