{
  "metadata": {
    "title": "สร้างแอป Next",
    "description": "สร้างโดย create next app"
  },
  "Header": {
    "Home": "หน้าแรก",
    "Certificate": "ใบรับรอง",
    "Documentation": "เอกสาร",
    "About": "เกี่ยวกับ"
  },
  "Resume": {
    "address": "156/ข หมู่ 6 บางปลากด ป่าโมก อ่างทอง 14130",

    "objectives": "นักศึกษาจบใหม่ที่มีความสนใจด้านการพัฒนา Web Application และ Backend System มีพื้นฐานการพัฒนาเว็บด้วย TypeScript, Node.js และ Database พร้อมประสบการณ์ใช้งานเครื่องมือและกระบวนการพัฒนาแบบสมัยใหม่ ต้องการเริ่มต้นเส้นทางอาชีพในตำแหน่ง Web Developer พร้อมเรียนรู้และพัฒนาทักษะใหม่ เพื่อมีส่วนร่วมในการพัฒนาระบบที่มีคุณภาพ ดูแลรักษาง่าย มีประสิทธิภาพ และสามารถขยายต่อในอนาคต เป็นผู้ที่ทำงานเป็นทีมได้ดี ชอบแก้ไขปัญหา พร้อมช่วยเหลือเพื่อนร่วมงาน และพัฒนาทักษะทางเทคนิคอย่างต่อเนื่อง",

    "education": {
      "university": "มหาวิทยาลัยธรรมศาสตร์",
      "region": "ประเทศไทย",
      "degree": "ปริญญาตรี, วิศวกรรมศาสตรบัณฑิต สาขาวิศวกรรมคอมพิวเตอร์"
    },

    "experiences": [
      {
        "topic": "งานในรายวิชา, มหาวิทยาลัยธรรมศาสตร์",
        "start": "Oct 2023",
        "end": "Dec 2023",
        "responsibilities": [
          "ติดตั้งและปรับใช้เซิร์ฟเวอร์ Linux โดยใช้ Rocky Linux 9 บนแพลตฟอร์มคลาวด์ Linode เพื่อโฮสต์เว็บแอปพลิเคชัน",
          "ตั้งค่าและดูแลบริการต่าง ๆ ได้แก่ DNS Server, Apache Web Server, ฐานข้อมูล MySQL และ SSH สำหรับการเข้าถึงระบบจากระยะไกล"
        ]
      },
      {
        "topic": "นักศึกษาฝึกงานด้าน IT Support, บริษัท เบอร์ล่า คาร์บอน (ประเทศไทย) จำกัด (มหาชน)",
        "start": "Jun 2024",
        "end": "Jul 2024",
        "responsibilities": [
          "ให้การสนับสนุนด้านเทคนิคแก่ผู้ใช้งาน แก้ไขปัญหาด้านฮาร์ดแวร์และซอฟต์แวร์",
          "ช่วยติดตั้ง ตั้งค่า และดูแลรักษาคอมพิวเตอร์ เครื่องพิมพ์ และอุปกรณ์เครือข่าย"
        ]
      },
      {
        "topic": "สำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ (สวทช.) (กลุ่มนวัตกรรมดิจิทัลสำหรับเมือง, ทีม Traffy)",
        "start": "Jan 2025",
        "end": "Apr 2025",
        "responsibilities": [
          "พัฒนา LINE Chatbot เพื่ออำนวยความสะดวกในการรายงานปัญหาภายในกลุ่ม LINE ช่วยเพิ่มประสิทธิภาพในการสื่อสารและการแก้ไขปัญหา"
        ]
      },
      {
        "topic": "ศูนย์การแพทย์สมเด็จพระเทพรัตนราชสุดาฯ (งานศึกษา วิจัยและบริการวิชาการ)",
        "start": "Aug 2025",
        "end": "Dec 2025",
        "responsibilities": [
          "พัฒนาระบบบริหารจัดการการสมัครฝึกงานบนเว็บ รองรับการจัดตารางอัตโนมัติและการจัดเก็บข้อมูลแบบรวมศูนย์",
          "ออกแบบสถาปัตยกรรมระบบแบบแยกส่วน Frontend-Backend โดยบูรณาการ Google Forms, Google Sheets และ Encore.ts เพื่อการจัดตารางอัตโนมัติและให้บริการ API"
        ]
      }
    ]
  }
}
